turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4c32/atdf/ATSAM4C32C_1.atdf
        <register caption="Host Pipe Mask Register (n = 0) 1" name="UOTGHS_HSTPIPIMR1" offset="0x5C4" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINE"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTE"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPE"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRE"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDE"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIE"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDE"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIE"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMA"/>
          <bitfield caption="Pipe Freeze" mask="0x00020000" name="PFREEZE"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
        </register>
        <register caption="Host Pipe Mask Register (n = 0) 2" name="UOTGHS_HSTPIPIMR2" offset="0x5C8" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINE"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTE"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPE"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRE"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDE"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIE"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDE"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIE"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMA"/>
          <bitfield caption="Pipe Freeze" mask="0x00020000" name="PFREEZE"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
        </register>
        <register caption="Host Pipe Mask Register (n = 0) 3" name="UOTGHS_HSTPIPIMR3" offset="0x5CC" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINE"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTE"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPE"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRE"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDE"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIE"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDE"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIE"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMA"/>
          <bitfield caption="Pipe Freeze" mask="0x00020000" name="PFREEZE"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
        </register>
        <register caption="Host Pipe Mask Register (n = 0) 4" name="UOTGHS_HSTPIPIMR4" offset="0x5D0" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINE"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTE"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPE"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRE"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDE"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIE"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDE"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIE"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMA"/>
          <bitfield caption="Pipe Freeze" mask="0x00020000" name="PFREEZE"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
        </register>
        <register caption="Host Pipe Enable Register (n = 0) 0" name="UOTGHS_HSTPIPIER0" offset="0x5F0" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINES"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTES"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPES"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRES"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIES"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIES"/>
          <bitfield caption="Number of Busy Banks Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMAS"/>
          <bitfield caption="Pipe Freeze Enable" mask="0x00020000" name="PFREEZES"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
        </register>
